Repository: PKBeam/AMWin-RP
Catalog: AMWin-RichPresence/Properties/Localisation.*.resx
Languages: ja, ko, tr

# Settings_General_UpdateOnStartup
source: Check for updates on startup
ja: 起動時にアップデートを確認
ko: 시작 시 업데이트 확인
tr: Açılışta güncellemeleri kontrol et

# Settings_General_ComposerAsArtist
source: Treat composer as artist
ja: 作曲者をアーティストとして扱う
ko: 작곡가를 아티스트로 표시
tr: Besteciyi sanatçı olarak kabul et

# Settings_General_RunOnWindowsStartup
source: Run when Windows starts
ja: Windows起動時に実行
ko: Windows 시작 시 실행
tr: Windows başladığında çalıştır

# Settings_General_AppleMusicRegion
source: Apple Music region
ja: Apple Musicの地域
ko: Apple Music 지역
tr: Apple Music bölgesi

# Settings_Discord_SectionTitle
source: Discord Rich Presence
ja: Discord リッチプレゼンス
tr: Discord ayarları

# Settings_Discord_EnableRP
source: Enable Discord Rich Presence
ja: Discord リッチプレゼンスを有効化
ko: Discord Rich Presence 사용
tr: Discord RP'yi etkinleştir

# Settings_Discord_ShowAlbumArt
source: Show album artwork
ja: アルバムアートを表示
ko: 앨범 아트 표시
tr: Kapak resimlerini göster

# Settings_Discord_ShowWhenPaused
source: Show when music is paused
ja: 音楽が一時停止中でも表示
ko: 음악이 일시정지되어도 표시
tr: Müzik duraklatıldığında RP'yi kapatma

# Settings_Discord_ShowAppleMusicIcon
source: Show Apple Music icon
ja: Apple Musicアイコンを表示
ko: Apple Music 아이콘 표시
tr: Durumda Apple Music ikonunu göster

# Settings_Discord_UserStatusDisplay
source: Show Discord status as
ja: Discordステータスの表示内容
ko: Discord 상태 표시 방식
tr: Discord Durum görünümü

# Settings_Discord_UserStatusDisplay_Artist
source: Artist name
ja: アーティスト名
ko: 아티스트 이름
tr: Sanatçı Adı

# Settings_Discord_UserStatusDisplay_SongName
source: Song name
ja: 曲名
ko: 곡 이름
tr: Şarkı Adı

# Settings_Discord_Lyrics_SectionTitle
source: Synced Lyrics (experimental)
ja: 同期歌詞（実験機能）
ko: 동기화 가사 (실험 기능)
tr: Şarkı sözü ayarları

# Settings_Discord_Lyrics_EnableLyrics
source: Show song lyrics in Rich Presence
ja: リッチプレゼンスに歌詞を表示
ko: Rich Presence에 가사 표시
tr: Senkronize şarkı sözlerini etkinleştir

# Settings_Discord_Lyrics_ShowDuringBreak
source: Keep lyrics during instrumental breaks
ja: 間奏中も歌詞を維持
ko: 연주 구간에도 가사 유지
tr: Söz satırını sonraki söze kadar uzat

# Settings_Discord_Lyrics_OpenCache
source: Show lyrics cache
ja: 歌詞キャッシュを開く
ko: 가사 캐시 열기
tr: Kaydedilen sözleri aç

# Settings_Discord_Lyrics_ClearCache
source: Clear lyrics cache
ja: 歌詞キャッシュを削除
ko: 가사 캐시 비우기
tr: Kaydedilen sözleri sil

# Settings_Scrobbling_SectionTitle
source: Scrobbling
ja: スクロブリング
ko: 스크로블링
tr: Scrobbling ayarları

# Settings_Scrobbling_CleanAlbumName
source: Clean up album name
ja: アルバム名を整形
ko: 앨범 이름 정리
tr: Albüm adını temizle

# Settings_Scrobbling_ScrobblePrimaryArtist
source: Only scrobble the first artist
ja: 最初のアーティストのみスクロブル
ko: 첫 번째 아티스트만 스크로블
tr: Sadece ana sanatçıyı scrobble et

# Settings_Scrobbling_SongDurationChoice
source: Use song duration from Apple Music website
ja: Apple Musicサイトの曲長を使用
ko: Apple Music 웹사이트의 곡 길이 사용
tr: Şarkı süresini Apple Music Web'den almayı tercih et

# Settings_Scrobbling_ScrobbleTime
source: Maximum scrobble wait:
ja: 最大スクロブル待機時間:
ko: 최대 스크로블 대기 시간:
tr: Scrobble öncesi max süre:

# Settings_Scrobbling_LastFM_ApiKey
source: API key
ja: APIキー
ko: API 키
tr: API Anahtarı

# Settings_Scrobbling_LastFM_ApiSecret
source: API secret
ja: APIシークレット
ko: API 시크릿
tr: API Gizli Anahtarı

# Settings_Scrobbling_LastFM_Username
source: Username
ja: ユーザー名
ko: 사용자 이름
tr: Kullanıcı adı

# Settings_Scrobbling_LastFM_Password
source: Password
ja: パスワード
ko: 비밀번호
tr: Şifre

# Settings_Scrobbling_ListenBrainz_UserToken
source: User token
ja: ユーザートークン
ko: 사용자 토큰
tr: Kullanıcı tokeni

# Settings_Scrobbling_LastFM_Enable
source: Enable Last.FM scrobbling
ja: Last.FM スクロブリングを有効化
ko: Last.FM 스크로블링 사용
tr: Last.FM'i etkinleştir

# Settings_Scrobbling_ListenBrainz_Enable
source: Enable ListenBrainz scrobbling
ja: ListenBrainz スクロブリングを有効化
ko: ListenBrainz 스크로블링 사용
tr: ListenBrainz'i etkinleştir

# Settings_Scrobbling_LastFM_SaveCredentials
source: Save credentials
ja: 認証情報を保存
ko: 자격 증명 저장
tr: Kimlik Bilgilerini Kaydet

# Message_ClearLyricCache
source: Are you sure you want to delete all saved lyrics?
ja: 保存された歌詞をすべて削除しますか？
ko: 저장된 가사를 모두 삭제하시겠습니까?
tr: Tüm kaydedilen sözleri silmek istediğinize emin misiniz?

# Message_ClearLyricCache_Title
source: Delete Cached Lyrics
ja: キャッシュした歌詞を削除
ko: 캐시된 가사 삭제
tr: Kaydedilen Sözleri Sil

# Message_ClearedLyricCache
source: All saved lyrics have been deleted.
ja: 保存された歌詞をすべて削除しました。
ko: 저장된 가사가 모두 삭제되었습니다.
tr: Tüm kaydedilen sözler silindi.

# Message_ClearedLyricCache_Title
source: Lyrics Deleted
ja: 歌詞を削除しました
ko: 가사 삭제 완료
tr: Sözler Silindi

# Message_ClearLyricCache_Fail
source: Could not delete lyrics:
ja: 歌詞を削除できませんでした:
ko: 가사를 삭제할 수 없습니다:
tr: Sözler silinemedi:

# Message_Error
source: Error
ja: エラー
ko: 오류
tr: Hata

# Message_ClearLyricCache_FailNotFound
source: No saved lyrics found.
ja: 保存された歌詞が見つかりません。
ko: 저장된 가사를 찾을 수 없습니다.
tr: Kaydedilen söz bulunamadı.

# Message_Information
source: Information
ja: 情報
ko: 정보
tr: Bilgi

# Message_LastFM_Authentication_Title
source: Last.FM Authentication
ja: Last.FM 認証
ko: Last.FM 인증
tr: Last.FM Doğrulaması

# Message_LastFM_Authentication_Fail
source: The Last.FM credentials could not be authenticated. Please make sure you have entered the correct username and password, and that your account is not currently locked.
ja: Last.FM の認証情報を確認できませんでした。ユーザー名とパスワードが正しいこと、およびアカウントがロックされていないことを確認してください。
ko: Last.FM 자격 증명을 인증할 수 없습니다. 사용자 이름과 비밀번호를 확인하고 계정이 잠겨 있지 않은지 확인하세요.
tr: Last.FM kimlik bilgileri doğrulanamadı. Lütfen kullanıcı adı ve şifrenizi doğru girdiğinizden ve hesabınızın kilitli olmadığından emin olun.

# Message_ListenBrainz_Authentication_Title
source: ListenBrainz Authentication
ja: ListenBrainz 認証
ko: ListenBrainz 인증
tr: ListenBrainz Doğrulaması

# Message_LastFM_Authentication_Success
source: The Last.FM credentials were successfully authenticated.
ja: Last.FM の認証情報を確認しました。
ko: Last.FM 자격 증명이 인증되었습니다.
tr: Last.FM kimlik bilgileri başarıyla doğrulandı.

# Message_ListenBrainz_Authentication_Fail
source: The ListenBrainz credentials could not be authenticated. Please make sure you have entered the correct user token.
ja: ListenBrainz の認証情報を確認できませんでした。ユーザートークンが正しいことを確認してください。
ko: ListenBrainz 자격 증명을 인증할 수 없습니다. 사용자 토큰을 확인하세요.
tr: ListenBrainz kimlik bilgileri doğrulanamadı. Lütfen kullanıcı tokeninizi doğru girdiğinizden emin olun.

# Message_ListenBrainz_Authentication_Success
source: The ListenBrainz credentials were successfully authenticated.
ja: ListenBrainz の認証情報を確認しました。
ko: ListenBrainz 자격 증명이 인증되었습니다.
tr: ListenBrainz kimlik bilgileri başarıyla doğrulandı.

# DiscordButton_ListenOnAppleMusic
source: Listen on Apple Music
ja: Apple Musicで聴く
ko: Apple Music에서 듣기
tr: Apple Music'de Dinle

# DiscordButton_ViewArtist
source: View Artist
ja: アーティストを表示
ko: 아티스트 보기
tr: Sanatçıyı Görüntüle

# Message_AppUpdate_Title
source: New update available
ja: 新しいアップデートがあります
ko: 새 업데이트 사용 가능

# Message_AppUpdate
source: A new update for AMWin-RP is available. Would you like to view the releases?
ja: AMWin-RP の新しいアップデートがあります。リリースページを開きますか？
ko: AMWin-RP의 새 업데이트가 있습니다. 릴리스 페이지를 보시겠습니까?

# Settings_Title
source: Settings
ja: 設定
ko: 설정
tr: Ayarlar

# Settings_TimeUnitSeconds
source: sec
ja: 秒
ko: 초
tr: sn

# Settings_General_TooltipAppleMusicRegionError
source: The input is not a valid region code for Apple Music.
ja: 入力は Apple Music の有効な地域コードではありません。
ko: 입력한 값이 Apple Music의 유효한 지역 코드가 아닙니다.

# Settings_General_ComposerAsArtist_Description
source: For classical music tracks, use the composer as the artist instead of the performer.
ja: クラシック曲では演奏者ではなく作曲者をアーティストとして使用します。
ko: 클래식 트랙에서 연주자 대신 작곡가를 아티스트로 사용합니다.

# Settings_Discord_ShowAppleMusicIcon_Description
source: Shows the Apple Music icon next to the album artwork in the Rich Presence display.
ja: リッチプレゼンス表示で、アルバムアートの横に Apple Music アイコンを表示します。
ko: Rich Presence에서 앨범 아트 옆에 Apple Music 아이콘을 표시합니다.

# Settings_Discord_Lyrics_ShowDuringBreak_Description
source: During breaks in the music, keep showing the last played lyrics.
ja: 音楽の区切りでも、直前の歌詞を表示し続けます。
ko: 음악의 공백 구간에서도 마지막 가사 줄을 계속 표시합니다.

# Settings_General_AppleMusicRegion_Description
source: The country code of the region of your Apple Account (e.g. US).
ja: Apple アカウントの地域コード（例: JP）。
ko: Apple 계정 지역의 국가 코드입니다 (예: KR).

# Settings_Scrobbling_SongDurationChoice_Description
source: Get the length of the song from the Apple Music website instead of the Last.FM website. Slower but may yield better results.
ja: Last.FM ではなく Apple Music のWebサイトから曲の長さを取得します。遅くなりますが精度が上がる場合があります。
ko: Last.FM 대신 Apple Music 웹사이트에서 곡 길이를 가져옵니다. 더 느리지만 더 정확할 수 있습니다.

# Settings_Scrobbling_ScrobbleTime_Description
source: After this amount of time has passed, scrobble the song if it hasn't been scrobbled already.
ja: この時間が経過した時点で、まだスクロブルされていない曲をスクロブルします。
ko: 이 시간이 지나면 아직 스크로블되지 않은 곡을 스크로블합니다.

# Message_Yes
source: Yes
ja: はい
ko: 예

# Message_No
source: No
ja: いいえ
ko: 아니요

# Settings_General_SectionTitle
source: General
ja: 一般
ko: 일반

# Settings_Scrobbling_CleanAlbumName_Description
source: Remove common suffixes like "Single" and "EP" from album names.
ja: アルバム名から「Single」や「EP」など一般的な接尾辞を削除します。
ko: 앨범 이름에서 "Single", "EP" 같은 일반 접미사를 제거합니다.

# Taskbar_Settings_Title
source: Settings
ja: 設定
ko: 설정
tr: Ayarlar

# Taskbar_Exit_Title
source: Exit
ja: 終了
ko: 종료

# Settings_General_Language
source: Language
ja: 言語
ko: 언어

# Settings_General_Language_Description
source: Restart the app after changing the language to fully apply it.
ja: 言語を変更した後は、完全に適用するためにアプリを再起動してください。
ko: 언어를 변경한 후 앱을 다시 시작해야 완전히 적용됩니다.

# Settings_General_Language_System
source: System default
ja: システム既定 (System default)
ko: 시스템 기본값

# Settings_General_Language_English
source: English
ja: 英語 (English)
ko: 영어

# Settings_General_Language_Turkish
source: Turkish
ja: トルコ語 (Türkçe)
ko: 터키어

# Settings_General_Language_Korean
source: Korean
ja: 韓国語 (한국어)
ko: 한국어

# Settings_General_Language_Japanese
source: Japanese
ja: 日本語 (日本語)

# Message_RestartRequired_Title
source: Restart Required
ja: 再起動が必要です
ko: 다시 시작 필요

# Message_RestartRequired_Content
source: Restart now to apply the language change?
ja: 言語変更を適用するために今すぐ再起動しますか？
ko: 언어 변경을 적용하려면 지금 다시 시작할까요?
